_org/_posts/2015-01-01-maven.org
#+STARTUP:showall
#+STARTUP: hidestars
#+OPTIONS: ^:{}
#+BEGIN_HTML
---
layout: view_simple
title: Maven笔记
excerpt: 
keywords: ""
categories: [JavaEE]
tags: [maven,javaee]
---

#+END_HTML

记录一些maven的使用和配置

#+BEGIN_HTML
<!-- more -->
#+END_HTML

* maven安装&配置

请确保你装了jdk

1.下载链接：http://maven.apache.org/download.cgi
2.解压就可以了

#+begin_src bash
 tar -zxvf apache-maven-3.1.0-bin.tar.gz
 mv apache-maven-3.1.0 /usr/local/
#+end_src

3.设置环境变量

在/etc/profile 文件最后添加

#+begin_src bash
M2_HOME=/usr/local/apache-maven-3.1.0
export MAVEN_OPTS="-Xms256m -Xmx512m"
export PATH=$M2_HOME/bin:$PATH 
#+end_src

保存并关闭。

要使配置生效必须重启机器或者在命令行输入： 

. /etc/profile 

查看是否安装成功

#+begin_src shell
mvn -version 
#+end_src

4.配置仓库地址

在 *$H2_HOME/conf/settings.xml* 中添加，地址改成自己的。

#+begin_src xml
<localRepository>/home/geekx/appdata/maven_repo</localRepository>
#+end_src


* maven 常用命令

** 创建项目 mvn archetype:create

+ 创建普通java项目

#+begin_src shell
mvn archetype:create -DgroupId=packageName    -DartifactId=projectName  
#+end_src

+ 创建java ee项目
#+begin_src shell
mvn archetype:create     -DgroupId=packageName        -DartifactId=webappName     -DarchetypeArtifactId=maven-archetype-webapp    
#+end_src

| Commond              | Discription                                                         |
|----------------------+---------------------------------------------------------------------|
| mvn archetype:create | 创建项目                                                            |
| mvn compile          | 编译源代码                                                          |
| mvn test-compile     | 编译测试代码                                                        |
| mvn test             | 运行测试.mvn test -skipping compile -skipping test-compile 跳过编译 |
| mvn site             | 产生site                                                            |
| mvn package          | 打包                                                                |
| mvn install          | 在本地Repository中安装jar                                           |
| mvn clean            | 清除产生的项目                                                      |
| mvn eclipse:eclipse  | 生成eclipse项目                                                     |
| mvn eclipse:clean    | 清除eclipse的一些系统设置                                           |
| mvn idea:idea        | 生成idea项目                                                        |
| mvn -Dtest package   | 组合使用goal命令，如只打包不测试                                    |
| mvn test-compile     | 编译测试的内容                                                      |
| mvn jar:jar          | 只打jar包                                                           |


* maven&eclipse

