_posts/2015-08-28-maven.html
---
layout: view
comments: true
title: Maven 使用笔记
categories: java
tags: [java,maven]
date: 2013-10-23
keywords: java,maven
description: maven 使用笔记
---

<p>
记录一些maven的使用和配置
</p>

<!-- more -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> maven安装&amp;配置</h2>
<div class="outline-text-2" id="text-1">
<p>
请确保你装了jdk
</p>

<p>
1.下载链接：<a href="http://maven.apache.org/download.cgi">http://maven.apache.org/download.cgi</a>
2.解压就可以了
</p>

<div class="org-src-container">

<pre class="src src-bash">tar -zxvf apache-maven-3.1.0-bin.tar.gz
mv apache-maven-3.1.0 /usr/local/
</pre>
</div>

<p>
3.设置环境变量
</p>

<p>
在/etc/profile 文件最后添加
</p>

<div class="org-src-container">

<pre class="src src-bash">M2_HOME=/usr/local/apache-maven-3.1.0
export MAVEN_OPTS="-Xms256m -Xmx512m"
export PATH=$M2_HOME/bin:$PATH
</pre>
</div>

<p>
保存并关闭。
</p>

<p>
要使配置生效必须重启机器或者在命令行输入： 
</p>

<p>
. /etc/profile 
</p>

<p>
查看是否安装成功
</p>

<div class="org-src-container">

<pre class="src src-shell">mvn -version
</pre>
</div>

<p>
4.配置仓库地址
</p>

<p>
在 <b>$H2_HOME/conf/settings.xml</b> 中添加，地址改成自己的。
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;localRepository&gt;/home/geekx/appdata/maven_repo&lt;/localRepository&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> maven 常用命令</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 创建项目 mvn archetype:create</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>创建普通java项目
</li>
</ul>

<div class="org-src-container">

<pre class="src src-shell">mvn archetype:create -DgroupId=packageName    -DartifactId=projectName
</pre>
</div>

<ul class="org-ul">
<li>创建java ee项目
</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">mvn archetype:create     -DgroupId=packageName        -DartifactId=webappName     -DarchetypeArtifactId=maven-archetype-webapp
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Commond</th>
<th scope="col" class="left">Discription</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">mvn archetype:create</td>
<td class="left">创建项目</td>
</tr>

<tr>
<td class="left">mvn compile</td>
<td class="left">编译源代码</td>
</tr>

<tr>
<td class="left">mvn test-compile</td>
<td class="left">编译测试代码</td>
</tr>

<tr>
<td class="left">mvn test</td>
<td class="left">运行测试.mvn test -skipping compile -skipping test-compile 跳过编译</td>
</tr>

<tr>
<td class="left">mvn site</td>
<td class="left">产生site</td>
</tr>

<tr>
<td class="left">mvn package</td>
<td class="left">打包</td>
</tr>

<tr>
<td class="left">mvn install</td>
<td class="left">在本地Repository中安装jar</td>
</tr>

<tr>
<td class="left">mvn clean</td>
<td class="left">清除产生的项目</td>
</tr>

<tr>
<td class="left">mvn eclipse:eclipse</td>
<td class="left">生成eclipse项目</td>
</tr>

<tr>
<td class="left">mvn eclipse:clean</td>
<td class="left">清除eclipse的一些系统设置</td>
</tr>

<tr>
<td class="left">mvn idea:idea</td>
<td class="left">生成idea项目</td>
</tr>

<tr>
<td class="left">mvn -Dtest package</td>
<td class="left">组合使用goal命令，如只打包不测试</td>
</tr>

<tr>
<td class="left">mvn test-compile</td>
<td class="left">编译测试的内容</td>
</tr>

<tr>
<td class="left">mvn jar:jar</td>
<td class="left">只打jar包</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> maven&amp;eclipse</h2>
</div>
